In [37]:
import pandas

In [38]:
ex=pandas.read_excel('excel_prac1.xlsx')

In [39]:
ex

              Name  Roll NO      SChool
0   pranjal shrama       40  st.anselms
1  pranshu  sharma       41  st.anselms
2        shiv soni       48         Kv1

In [40]:
s=ex.head(1)

In [41]:
ex['Name']

0     pranjal shrama
1    pranshu  sharma
2          shiv soni
Name: Name, dtype: object

In [42]:
ex.to_excel('write_excel.xlsx',index=False)

In [43]:
s.to_excel('write_excel.xlsx',index=False)

# To add row

In [48]:
df1=pandas.DataFrame([['Rohit sharma','44','Gavar public school']],columns=['Name','Roll NO','SChool'])
ex=ex.append(df1)
ex.index=range(1,len(ex)+1)

In [49]:
ex=ex.sort_index()

In [50]:
ex

              Name Roll NO               SChool
1   pranjal shrama      40           st.anselms
2     Rohit sharma      44  Gavar public school
3  pranshu  sharma      41           st.anselms
4        shiv soni      48                  Kv1
5     Rohit sharma      44  Gavar public school
6     Rohit sharma      44  Gavar public school

In [51]:
ex.drop(6)

              Name Roll NO               SChool
1   pranjal shrama      40           st.anselms
2     Rohit sharma      44  Gavar public school
3  pranshu  sharma      41           st.anselms
4        shiv soni      48                  Kv1
5     Rohit sharma      44  Gavar public school

In [52]:
ex

              Name Roll NO               SChool
1   pranjal shrama      40           st.anselms
2     Rohit sharma      44  Gavar public school
3  pranshu  sharma      41           st.anselms
4        shiv soni      48                  Kv1
5     Rohit sharma      44  Gavar public school
6     Rohit sharma      44  Gavar public school